Dataset: https://www.kaggle.com/c/competitive-data-science-final-project/data

In [1]:
import pandas as pd

In [2]:
train = pd.read_csv("data/sales_train_v2.csv")
test = pd.read_csv("data/test.csv")
items = pd.read_csv("data/items.csv")
item_cats = pd.read_csv("data/item_categories.csv")
shops = pd.read_csv("data/shops.csv")

In [3]:
train.head().T

                         0           1           2           3           4
date            02.01.2013  03.01.2013  05.01.2013  06.01.2013  15.01.2013
date_block_num           0           0           0           0           0
shop_id                 59          25          25          25          25
item_id              22154        2552        2552        2554        2555
item_price             999         899         899     1709.05        1099
item_cnt_day             1           1          -1           1           1

In [4]:
# Add datetime column
train["datetime"] = pd.to_datetime(train.date, format="%d.%m.%Y")

In [5]:
def get_year(x):
    return x.year

def get_month(x):
    return x.month

def get_day(x):
    return x.day

In [6]:
# Split datetime
train["year"] = train.datetime.apply(get_year)
train["month"] = train.datetime.apply(get_month)
train["day"] = train.datetime.apply(get_day)

In [7]:
train.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,datetime,year,month,day
0,02.01.2013,0,59,22154,999.00,1.0,2013-01-02,2013,1,2
1,03.01.2013,0,25,2552,899.00,1.0,2013-01-03,2013,1,3
2,05.01.2013,0,25,2552,899.00,-1.0,2013-01-05,2013,1,5
3,06.01.2013,0,25,2554,1709.05,1.0,2013-01-06,2013,1,6
4,15.01.2013,0,25,2555,1099.00,1.0,2013-01-15,2013,1,15

In [8]:
# Sort by datetime
train = train.sort_values("datetime")

In [9]:
train.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,datetime,year,month,day
49800,01.01.2013,0,18,5823,2500.0,1.0,2013-01-01,2013,1,1
29784,01.01.2013,0,27,5573,849.0,1.0,2013-01-01,2013,1,1
35476,01.01.2013,0,7,1006,399.0,1.0,2013-01-01,2013,1,1
8330,01.01.2013,0,19,17707,899.0,1.0,2013-01-01,2013,1,1
57384,01.01.2013,0,14,19548,149.0,1.0,2013-01-01,2013,1,1

In [10]:
%mkdir -p data/v1

In [11]:
# save as v1
train.to_csv("data/v1/train.csv")